visualización de diagrama de secuencia
